{"en":{"variables_storageConnStringLabel":"Storage account connection","variables_appSettingsHelp":"The name of the app setting containing your storage account connection string.","variables_selectConnection":"Click select to choose a connection","TimerTrigger_description":"A function that will be run on a specified schedule","timerTrigger_displayName":"Timer","timerTrigger_schedule_label":"Schedule","timerTrigger_schedule_help":"Enter a cron expression of the format '{second} {minute} {hour} {day} {month} {day of week}' to specify the schedule.","timerTrigger_schedule_errorText":"Invalid Cron Expression. Please consult https://docs.microsoft.com/en-us/azure/azure-functions/functions-bindings-timer#cron-expressions to learn more.","QueueTrigger_description":"A function that will be run whenever a message is added to a specified Azure Storage queue","queueTrigger_displayName":"Azure Queue Storage","queueTrigger_queueName_label":"Queue name","queueTrigger_queueName_help":"Name of the queue from which the message will be read","queueTrigger_queueName_errorText":"Queue name must start and end with a letter or number, and it can contain only lowercase letters, numbers, and the hyphen. The name must be 3 to 63 characters.","BlobTrigger_description":"A function that will be run whenever a blob is added to a specified container","blobTrigger_displayName":"Azure Blob Storage","blobTrigger_path_label":"Path","blobTrigger_path_help":"The path within your storage account that the trigger will monitor.","blobTrigger_path_errorText":"Your blob path must be a container name of 3 to 63 characters, followed by a blob name of 1 to 1,024 characters. The blob name can be any combination of characters and can contain a maximum of 254 path segments, which are separated by the forward slash (/).","HttpTrigger_description":"A function that will be run whenever it receives an HTTP request, responding based on data in the body or query string","httpTrigger_displayName":"HTTP","httpTrigger_authLevel_label":"Authorization level","httpTrigger_authLevel_help":"Authorization level controls whether the function requires an API key and which key to use; Function uses a function key; Admin uses your master key. The function and master keys are found in the 'keys' management panel on the portal, when your function is selected. For user-based authentication, go to Function App Settings.","ServiceBusQueueTrigger_description":"A function that will be run whenever a message is added to a specficied Service Bus queue","serviceBusTrigger_displayName":"Azure Service Bus","serviceBusTrigger_connection_label":"Service Bus connection","serviceBusTrigger_connection_help":"The name of the app setting containing your Service Bus connection string. The connection string must have Listen rights.","serviceBusTrigger_queueName_label":"Queue name","serviceBusTrigger_queueName_help":"The queue from which the message will be read.","serviceBusTrigger_queueName_errorText":"Queue name must start and end with a letter or number, and it can contain only letters, numbers, the hyphen, the period, and the underscore. The name must be 1 to 50 characters.","ServiceBusTopicTrigger_description":"A function that will be run whenever a message is added to the specified Service Bus Topic","serviceBusTrigger_topicName_label":"Topic name","serviceBusTrigger_topicName_help":"The name of the topic from which the message will be read.","serviceBusTrigger_topicName_errorText":"Topic name must start and end with a letter or number, and it can contain only letters, numbers, the hyphen, the period, and the underscore. The name must be 1 to 50 characters.","serviceBusTrigger_subscriptionName_label":"Subscription name","serviceBusTrigger_subscriptionName_help":"Subscription name within the topic to bind to.","serviceBusTrigger_subscriptionName_errorText":"Subscription name must start and end with a letter or number, and it can contain only letters, numbers, the hyphen, the period, and the underscore. The name must be 1 to 50 characters.","EventGridTrigger_description":"A function that will be run whenever an event grid receives a new event","EventHubTrigger_description":"A function that will be run whenever an event hub receives a new event","eventHubTrigger_displayName":"Azure Event Hubs","eventHubTrigger_connection_label":"Event Hub connection","eventHubTrigger_connection_help":"The name of the app setting containing your Event Hub connection string. The connection string must have Receive permissions.","eventHubOut_path_label":"Event Hub name","eventHubTrigger_path_help":"The name of the event hub from which to trigger","eventHubTrigger_path_errorText":"The event hub name must start and end with a letter or number, and it can contain only letters, numbers, the hyphen, the period, and the underscore. The name must be 1 to 50 characters.","eventHubTrigger_consumerGroup_label":"Event Hub consumer group","eventHubTrigger_consumerGroup_help":"Event Hub consumer group from which to receive events","eventHubTrigger_consumerGroup_errorText":"The consumer group must start and end with a letter or number, and it can contain only letters, numbers, the hyphen, the period, and the underscore. The $Default group is also allowed. The name must be 1 to 50 characters.","CosmosDBTrigger_description":"A function that will be run whenever documents change in a document collection","cosmosDB_trigger_displayName":"Azure Cosmos DB","cosmosDBIn_connection_label":"Cosmos DB account connection","cosmosDBIn_connection_help":"The name of the App Setting containing the connection string to the service that contains the collection to be monitored.","cosmosDBIn_databaseName_label":"Database name","cosmosDBIn_databaseName_help":"Name of the Cosmos DB database that includes the collection to be monitored.","cosmosDBIn_collectionName_label":"Collection name","cosmosDBIn_collectionName_help":"Name of the collection to be monitored.","cosmosDBIn_leaseCollectionName_label":"Collection name for leases","cosmosDBIn_leaseCollectionName_help":"Name of the collection to store the leases.","cosmosDBIn_createIfNotExists_label":"Create lease collection if it does not exist","cosmosDBIn_createIfNotExists_help":"Checks for existence and automatically creates the leases collection.","RabbitMQTrigger_description":"A function that will be run whenever a message is added to a specified RabbitMQ queue","rabbitMqTrigger_displayName":"RabbitMQ","rabbitMqIn_connectionStringSetting_label":"Connection string setting name","rabbitMqIn_connectionStringSetting_help":"The name of the app setting containing your RabbitMQ connection.","rabbitMqIn_queueName_label":"Queue name","rabbitMqIn_queueName_help":"This is the queue name."}}
